Revit 2027 API
RebarUpdateCurvesData.GetCustomConstraints Method
 Gets all rebar constraints that are attached to custom handles for this rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<RebarConstraint> GetCustomConstraints()
Public Function GetCustomConstraints As IList(Of RebarConstraint)
public:
IList<RebarConstraint^>^ GetCustomConstraints()
member GetCustomConstraints : unit -> IList<RebarConstraint>
Return Value
IList<RebarConstraint>
 Returns all rebar constraints that are attached to custom handles for this rebar. This array does not contains the start and end constraints.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace